# 1.1
# 1) Установите Python и PyCharm
# 2) Напишите и запустите программу.которая выводит строку "Hello world!"

print("Hello, world!")
# 3) Напишите программу, которая на входе получает имя пользователя, cохраняет его в переменную
# user_name и выводит строку "Hello {user_name}!"

user_name = input("Введите имя: ")
print(f'Hello {user_name}!')