# 1.2
# 1) Напишите программу, чтобы вывести:
# *********
# *       *
# *       *
# *********

print("*" * 9)
print("*" + " " * 7 + "*")
print("*" + " " * 7 + "*")
print("*" * 9)